///******************Testing data*****************************

List bookNames = ['Chinese 2'];
List comprehensions = [
  '我的一个朋友在办公室工作，每天上八小时的班。最快的时候，要工作十个小时，整天快得不得了。她要一张一张地打印文件，然后一份一份地送到别人手里。我觉得她的工作又麻烦又没有意思，可是她却说：“工作使我快乐。不让我工作，我可爱不了。”',
  '快乐变得越来越重要了。可是怎样才使自己快乐呢？我没问过男人们，却问过许多女人，回答是各种各样的。一个爱美的女孩子，在公园的台阶上一级一级的往上走。她笑着说：“爬台阶能使我减肥。我可不喜欢自己变胖，看着自己一天比一天瘦，让我特别开心。”'
];
List comprehensions1 = [
  '那是一个难忘的时刻，那一刻改变了我的一生。紧张的高考结束了，我们班开了一个告别晚会。那天我的心情又高兴又难过。高兴的是新的生活就要开始了，难过的要和同学们告别了。晚会快结束了，漂亮的班主任李老师说，她送给全班每个人一件的礼物，然后，还有要一件特殊的礼物送给班里最可爱同学。',
  '晚会上，老师送给每个同学一件纪念品。最后，她说要发特殊礼物了。大家写上紧张起来，我们都想得到那件特殊礼物，特别男同学，因为所有的男同学都喜欢这位美丽的班主任。',
];
List comprehensions2 = [
  '谁是最可爱同学呢？老师说，做了下面的游戏就知道了。老师发给每个人一张纸，然后她让每个人在纸写一个数字。这个数字表示班里有几个自己不喜欢的人，然后写上自己的名字。同学们都很认真，写完以后交给了老师',
  '从前人们见面打招呼的时候说：“吃了吗？”后来见面打招呼改成了：“你好！”现在越来越多的人见面时问：“过得快乐吗？”'
];
List comprehensions3 = [
  '一个母亲，不穿好的，不吃好的，每天辛辛苦苦。可是她却笑着回答我：“全家平平安安就让我快乐。看着孩子们的生活一天比一天好，让我特别满足。”',
  '那是一个难忘的时刻，那一刻改变了我的一生。紧张的高考结束了，我们班开了一个告别晚会。那天我的心情又高兴又难过。高兴的是新的生活就要开始了，难过的要和同学们告别了。晚会快结束了，漂亮的班主任李老师说，她送给全班每个人一件的礼物，然后，还有要一件特殊的礼物送给班里最可爱同学。'
];

///****************************Real Data*****************************

//List namesOfBooks = ['Chinese 2'];

List chapter9TingXie = [
  '那是',
  '难忘',
  '时刻',
  '一刻',
  '改变了',
  '紧张',
  '高考',
  '结束了',
  '我们班开',
  '告别晚会',
  '心情',
  '高兴',
  '难过',
  '漂亮',
  '班主任',
  '送给',
  '礼物',
  '然后',
  '特殊',
  '可爱的',
  '游戏',
  '知道了',
  '一张纸',
  '上写',
  '数字',
  '表示',
  '自己',
  '喜欢',
  '老师',
  '纪念品',
  '都想',
  '特别',
  '男同学',
  '这位',
  '美丽',
  '当然',
  '包括',
  '知道',
  '请刘',
  '文辉',
  '前面来',
  '敢相信',
  '耳朵',
  '成绩',
  '觉得',
  '不好意思',
  '地走到',
  '微笑',
  '额头上',
  '径轻',
  '地吻',
  '向全',
  '文辉',
  '数字',
  '教室里',
  '响起',
  '热烈',
  '掌声',
  '谁有',
  '这么',
  '幸福',
  '激动',
  '得流下',
  '眼泪',
  '以前',
  '地方',
  '开始',
  '发生',
  '变化'
];

List chapter9Comprehension = [
  '''那是一个难忘的时刻,那一刻改变了我的
生。紧张的高考结束了,我们班开了一个告别晚
会。那天我的心情又高兴又难过。高兴的是的
生活就要开始了,难过的是要和同学们告别了
晚会快结束的时候,漂亮的班主任李老师说,
她要送给全班每个人一件同样的礼物,然后,还
有一件特殊的礼物送给班里最可爱的同学。''',
  '''谁是最可爱的同学呢?老师说,做了下面的
游戏就知道了老师发给每个人一张纸,然后地
让每个人在纸上写一个数字,这个数字表示班里
有几个自己不喜欢的人,然后写上自己的名字。
同学们都很认真,写完以后交给了老师。

''',
  '''晚会上,老师送给每个同学一件纪念品。最
后,她说要发特殊礼物了。大家马上紧张起来,
我们都想得到那件特殊礼物,特别是男同学,因
为所有的男同学都喜欢这位美丽的班主任,当然
也包括我,可是我知道自己不可能是那个最可爱
的同学。''',
  '''“请刘文辉同学到前面来。”我真不敢相信
自己的耳朵,因为我的学习成绩不如别人好,运
动也不如别人好,什么都不如别人,我觉得全班
同学都比我好。''',
  '''可是,这是真的! 我不好意思地走到前面,
不知道老师要给我什么礼物。她微笑着,在我的额头上径轻地吻了一下,然后向全班同学说:
“这就是我的礼物,因为全班只有刘文辉同学写
的数字是 “0”,他是我们班最可爱的同学!”教
室里响起了热烈的掌声。''',
  '''“什么,我成了最可爱的同学? 这是真的 !
现在谁有我这么幸福?”我激动得流下了眼泪。
以前,我从来没喜欢过自己,从来不知道自
己有什么可爱的地方,但从这一刻开始,我的人
生发生了变化。''',
];

Map<String, Map<String, List>> allData = {
  bookNames[0]: {
    '爱的教育': chapter9Comprehension,
  },
};
